saikumar-mandaji/arduino-nrf54/boards.txt
menu.debug=Debug
menu.prog=Programmer

nrf54l15dk.name=Nordic nRF54L15-DK

nrf54l15dk.upload.tool=nrfjprog
nrf54l15dk.upload.protocol=jlink
nrf54l15dk.upload.maximum_size=1531904
nrf54l15dk.upload.maximum_data_size=262144
nrf54l15dk.upload.use_1200bps_touch=false
nrf54l15dk.upload.wait_for_upload_port=false

nrf54l15dk.build.core=nrf54l
nrf54l15dk.build.variant=nrf54l15dk
nrf54l15dk.build.mcu=cortex-m33
nrf54l15dk.build.fpu=-mfpu=fpv5-sp-d16
nrf54l15dk.build.float-abi=-mfloat-abi=hard
nrf54l15dk.build.board=NRF54L15DK
nrf54l15dk.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS
nrf54l15dk.build.ldscript=nrf54l15_xxaa_application.ld
nrf54l15dk.build.openocdscript=

nrf54l15dk.menu.debug.on=Enabled
nrf54l15dk.menu.debug.on.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DDEBUG_NRF
nrf54l15dk.menu.debug.off=Disabled
nrf54l15dk.menu.debug.off.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DNDEBUG

## Seeed Studio XIAO nRF54L15 / XIAO nRF54L15 Sense
## Same nRF54L15 die as the DK -- see variants/xiao_nrf54l15/pins_arduino.h
## for pin provenance. Upload path is NOT verified for this board: unlike
## the DK, XIAO boards don't have a built-in J-Link, and whether this
## board exposes SWD test pads for nrfjprog or needs a different
## bootloader/UF2-style flow hasn't been checked against real hardware or
## Seeed's own docs this session. The default programmer below
## (nrfjprog/jlink) is kept as-is for consistency with the other boards,
## but is almost certainly the wrong choice in practice for a board with
## no onboard debug probe -- the OpenOCD options below (which work with a
## cheap external CMSIS-DAP or ST-Link SWD probe wired to this board's
## SWDIO/SWDCLK pads) are the more realistic upload path until someone
## confirms the actual SWD pad locations against real hardware or
## Seeed's own docs.
xiao_nrf54l15.name=Seeed Studio XIAO nRF54L15

xiao_nrf54l15.upload.tool=nrfjprog
xiao_nrf54l15.upload.protocol=jlink
xiao_nrf54l15.upload.maximum_size=1531904
xiao_nrf54l15.upload.maximum_data_size=262144
xiao_nrf54l15.upload.use_1200bps_touch=false
xiao_nrf54l15.upload.wait_for_upload_port=false

xiao_nrf54l15.build.core=nrf54l
xiao_nrf54l15.build.variant=xiao_nrf54l15
xiao_nrf54l15.build.mcu=cortex-m33
xiao_nrf54l15.build.fpu=-mfpu=fpv5-sp-d16
xiao_nrf54l15.build.float-abi=-mfloat-abi=hard
xiao_nrf54l15.build.board=XIAO_NRF54L15
xiao_nrf54l15.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS
xiao_nrf54l15.build.ldscript=nrf54l15_xxaa_application.ld
xiao_nrf54l15.build.openocdscript=
xiao_nrf54l15.build.openocd_interface=cmsis-dap

xiao_nrf54l15.menu.debug.on=Enabled
xiao_nrf54l15.menu.debug.on.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DDEBUG_NRF
xiao_nrf54l15.menu.debug.off=Disabled
xiao_nrf54l15.menu.debug.off.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DNDEBUG

xiao_nrf54l15.menu.prog.nrfjprog=nrfjprog (onboard/genuine SEGGER J-Link)
xiao_nrf54l15.menu.prog.nrfjprog.upload.tool=nrfjprog
xiao_nrf54l15.menu.prog.openocd_cmsisdap=OpenOCD (external CMSIS-DAP probe)
xiao_nrf54l15.menu.prog.openocd_cmsisdap.upload.tool=openocd
xiao_nrf54l15.menu.prog.openocd_cmsisdap.build.openocd_interface=cmsis-dap
xiao_nrf54l15.menu.prog.openocd_stlink=OpenOCD (external ST-Link probe)
xiao_nrf54l15.menu.prog.openocd_stlink.upload.tool=openocd
xiao_nrf54l15.menu.prog.openocd_stlink.build.openocd_interface=stlink
xiao_nrf54l15.menu.prog.openocd_jlink=OpenOCD (external J-Link, via OpenOCD instead of nrfjprog)
xiao_nrf54l15.menu.prog.openocd_jlink.upload.tool=openocd
xiao_nrf54l15.menu.prog.openocd_jlink.build.openocd_interface=jlink

## Ezurio BL54L15 DVK (nRF54L15 module dev kit)
## Same nRF54L15 die as the DK -- see variants/ezurio_bl54l15dvk/pins_arduino.h
## for pin provenance (this board's devicetree matches the DK's reference
## design almost exactly: same LED/button/SPI-flash pins). Like the DK,
## this is a proper dev kit with an onboard debug probe, so the nrfjprog
## upload path is expected to work the same way -- but this is still
## NOT independently verified against real hardware.
ezurio_bl54l15dvk.name=Ezurio BL54L15 DVK

ezurio_bl54l15dvk.upload.tool=nrfjprog
ezurio_bl54l15dvk.upload.protocol=jlink
ezurio_bl54l15dvk.upload.maximum_size=1531904
ezurio_bl54l15dvk.upload.maximum_data_size=262144
ezurio_bl54l15dvk.upload.use_1200bps_touch=false
ezurio_bl54l15dvk.upload.wait_for_upload_port=false

ezurio_bl54l15dvk.build.core=nrf54l
ezurio_bl54l15dvk.build.variant=ezurio_bl54l15dvk
ezurio_bl54l15dvk.build.mcu=cortex-m33
ezurio_bl54l15dvk.build.fpu=-mfpu=fpv5-sp-d16
ezurio_bl54l15dvk.build.float-abi=-mfloat-abi=hard
ezurio_bl54l15dvk.build.board=EZURIO_BL54L15DVK
ezurio_bl54l15dvk.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS
ezurio_bl54l15dvk.build.ldscript=nrf54l15_xxaa_application.ld
ezurio_bl54l15dvk.build.openocdscript=

ezurio_bl54l15dvk.menu.debug.on=Enabled
ezurio_bl54l15dvk.menu.debug.on.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DDEBUG_NRF
ezurio_bl54l15dvk.menu.debug.off=Disabled
ezurio_bl54l15dvk.menu.debug.off.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DNDEBUG

## Raytac AN54LQ-DB-15 (nRF54L15 module dev board; AN54LV-DB-15 is
## pin-compatible per Zephyr's own board docs).
## Same nRF54L15 die as the DK -- see variants/raytac_an54lq15db/pins_arduino.h
## for pin provenance (this board's devicetree matches the DK's reference
## design almost exactly: same LED/button/SPI-flash pins; Wire pins are a
## placeholder inferred from the Ezurio board, not independently
## confirmed for this one -- see the variant file's comments). Like the
## DK, this is a dev board with an onboard debug probe, so the nrfjprog
## upload path is expected to work the same way -- but this is still NOT
## independently verified against real hardware.
raytac_an54lq15db.name=Raytac AN54LQ-DB-15

raytac_an54lq15db.upload.tool=nrfjprog
raytac_an54lq15db.upload.protocol=jlink
raytac_an54lq15db.upload.maximum_size=1531904
raytac_an54lq15db.upload.maximum_data_size=262144
raytac_an54lq15db.upload.use_1200bps_touch=false
raytac_an54lq15db.upload.wait_for_upload_port=false

raytac_an54lq15db.build.core=nrf54l
raytac_an54lq15db.build.variant=raytac_an54lq15db
raytac_an54lq15db.build.mcu=cortex-m33
raytac_an54lq15db.build.fpu=-mfpu=fpv5-sp-d16
raytac_an54lq15db.build.float-abi=-mfloat-abi=hard
raytac_an54lq15db.build.board=RAYTAC_AN54LQ15DB
raytac_an54lq15db.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS
raytac_an54lq15db.build.ldscript=nrf54l15_xxaa_application.ld
raytac_an54lq15db.build.openocdscript=

raytac_an54lq15db.menu.debug.on=Enabled
raytac_an54lq15db.menu.debug.on.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DDEBUG_NRF
raytac_an54lq15db.menu.debug.off=Disabled
raytac_an54lq15db.menu.debug.off.build.extra_flags=-DNRF54L15_XXAA -DNRF_APPLICATION -D__STARTUP_CLEAR_BSS -DNDEBUG
